conf = {("1", "Беляев", "Особенности риска", "Физика и химия"),
       ("2", "Степанов", "Математическая кибернетика", "Математика и программирование"),
       ("3", "Клочкова", "Физика твердого тела", "Физика и химия"),
       ("4", "Клочкова", "Математика как наука", "Математика и программирование"),
       ("5", "Свиридова", "Информатика как наука", "Математика и программирование"),
       ("6", "Конев", "Проблемы облачного хранения", "Математика и программирование"),
       ("7", "Лосев", "Математика в истории", "Математика и программирование"),
       ("8", "Лосев", "Химия твердого тела", "Физика и химия"),
       ("9", "Свиридова", "Физические процессы", "Физика и химия"),
       ("10", "Баранов", "Биохимия", "Физика и химия")}
sections = set()
names = set()
all_names = list()
double_sect_stud = set()
single_sect_stud = set()

print("\nВсего докладов в конференции:", len(conf))

print("\nВего секций в конференции:")

for pres in conf:
    sections.add(pres[3])

for i in sections:
    print(i)

print("\nСписок участников:")
for pres in conf:
    names.add(pres[1])
    all_names.append(pres[1])

for i in names:
    print(i)

print("\nКоличество участников:", len(names))

print("\nСписок участников конференции, задействованных в обеих секциях:")

for stud1 in conf:
    for stud2 in conf:
        if ((stud1[1] == stud2[1]) and (stud1[3] != stud2[3])):
            double_sect_stud.add(stud1[1])

for i in double_sect_stud:
    print(i)

print("\nКоличество участников конференции, задействованных в обеих секциях:", len(double_sect_stud))

print("\nСписок участников конференции, участвующих только в одной секции:")

for stud1 in conf:
    for stud2 in conf:
        if ((stud1[1] == stud2[1]) and (stud1[3] != stud2[3])):
            all_names.remove(stud1[1])

for i in all_names:
    print(i)

print("\nКоличество участников конференции, участвующих только в одной секции:", len(all_names))
